1. Missing Value
2. apply

In [ ]:
import seaborn as sns
DF = sns.load_dataset('titanic')

DF

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0           0       3    male  22.0  ...   NaN  Southampton     no  False
1           1       1  female  38.0  ...     C    Cherbourg    yes  False
2           1       3  female  26.0  ...   NaN  Southampton    yes   True
3           1       1  female  35.0  ...     C  Southampton    yes  False
4           0       3    male  35.0  ...   NaN  Southampton     no   True
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
886         0       2    male  27.0  ...   NaN  Southampton     no   True
887         1       1  female  19.0  ...     B  Southampton    yes   True
888         0       3  female   NaN  ...   NaN  Southampton     no  False
889         1       1    male  26.0  ...     C    Cherbourg    yes   True
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[891 rows x 15 columns]

In [ ]:
DF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [ ]:
DF['deck']

0      NaN
1        C
2      NaN
3        C
4      NaN
      ...
886    NaN
887      B
888    NaN
889      C
890    NaN
Name: deck, Length: 891, dtype: category
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [ ]:
DF['deck'].value_counts(dropna=False)

NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: deck, dtype: int64

In [ ]:
DF.head(10).isnull()

   survived  pclass    sex    age  ...   deck  embark_town  alive  alone
0     False   False  False  False  ...   True        False  False  False
1     False   False  False  False  ...  False        False  False  False
2     False   False  False  False  ...   True        False  False  False
3     False   False  False  False  ...  False        False  False  False
4     False   False  False  False  ...   True        False  False  False
5     False   False  False   True  ...   True        False  False  False
6     False   False  False  False  ...  False        False  False  False
7     False   False  False  False  ...   True        False  False  False
8     False   False  False  False  ...   True        False  False  False
9     False   False  False  False  ...   True        False  False  False

[10 rows x 15 columns]

In [ ]:
DF.isnull()

     survived  pclass    sex    age  ...   deck  embark_town  alive  alone
0       False   False  False  False  ...   True        False  False  False
1       False   False  False  False  ...  False        False  False  False
2       False   False  False  False  ...   True        False  False  False
3       False   False  False  False  ...  False        False  False  False
4       False   False  False  False  ...   True        False  False  False
..        ...     ...    ...    ...  ...    ...          ...    ...    ...
886     False   False  False  False  ...   True        False  False  False
887     False   False  False  False  ...  False        False  False  False
888     False   False  False   True  ...   True        False  False  False
889     False   False  False  False  ...  False        False  False  False
890     False   False  False  False  ...   True        False  False  False

[891 rows x 15 columns]

In [ ]:
DF.isnull().sum(axis=0)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [ ]:
DF.head(10).isnull().sum(axis=1)

0    1
1    0
2    1
3    0
4    1
5    2
6    0
7    1
8    1
9    1
dtype: int64

In [ ]:
DF.dropna(thresh =300, axis=1).shape

(891, 14)

In [ ]:
DF.dropna(thresh=300, axis=0).shape

(0, 15)

In [ ]:
DF.dropna(subset=['age'], how='any', axis=0).shape

(714, 15)

In [ ]:
DF.dropna(axis=0, subset=['age'], how='any').shape

NameError: ignored

In [ ]:
DF.dropna(subset=['age'],how='any').shape

NameError: ignored

In [ ]:
DF.dropna(axis=0, how='any').shape

(182, 15)

In [ ]:
DF['age'].head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

In [ ]:
DF['age'].fillna(int(DF['age'].mean(axis=0)),inplace=True)

In [ ]:
DF['age'].head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5    29.0
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

In [ ]:
DF['embark_town'][825:830]

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829            NaN
Name: embark_town, dtype: object

In [ ]:
most_freq=DF['embark_town'].value_counts(dropna=True).idxmax()

In [ ]:
most_freq

'Southampton'

In [ ]:
DF['embark_town'][825:830]

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829            NaN
Name: embark_town, dtype: object

In [ ]:
DF['embark_town'].fillna(most_freq, inplace=True)

In [ ]:
DF['embark_town'][825:830]

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829    Southampton
Name: embark_town, dtype: object

In [ ]:
DF=sns.load_dataset('titanic')

In [ ]:
DF['embark_town'][828:831]

828    Queenstown
829           NaN
830     Cherbourg
Name: embark_town, dtype: object

In [ ]:
DF['embark_town'].fillna(method='ffill', inplace=True)

In [ ]:
DF['embark_town'][828:831]

828    Queenstown
829    Queenstown
830     Cherbourg
Name: embark_town, dtype: object

In [ ]:
DF=sns.load_dataset('titanic')

In [ ]:
DF['embark_town'][828:831]

828    Queenstown
829           NaN
830     Cherbourg
Name: embark_town, dtype: object

In [ ]:
DF['embark_town'].fillna(method='bfill', inplace=True)

In [ ]:
DF['embark_town'][828:831]

828    Queenstown
829     Cherbourg
830     Cherbourg
Name: embark_town, dtype: object

In [ ]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

DF = titanic.loc[:,['age','fare']].head(5)

DF

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [ ]:
DF.apply(sum, axis=0)

age     156.0000
fare    147.6083
dtype: float64

In [ ]:
DF.apply(sum, axis = 1)

0     29.2500
1    109.2833
2     33.9250
3     88.1000
4     43.0500
dtype: float64

In [ ]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

titanic.head(3)

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True

[3 rows x 15 columns]

In [ ]:
# True/ False로만 나오기 때문에, True에 해당하는 행만 출력

Filter_1 = (titanic.age >=10) & (titanic.age < 20)
titanic.loc[Filter_1, :].head()

    survived  pclass     sex   age  ...  deck  embark_town  alive  alone
9          1       2  female  14.0  ...   NaN    Cherbourg    yes  False
14         0       3  female  14.0  ...   NaN  Southampton     no   True
22         1       3  female  15.0  ...   NaN   Queenstown    yes   True
27         0       1    male  19.0  ...     C  Southampton     no  False
38         0       3  female  18.0  ...   NaN  Southampton     no  False

[5 rows x 15 columns]

In [ ]:
Filter_1

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887     True
888    False
889    False
890    False
Name: age, Length: 891, dtype: bool

In [ ]:
Filter_2 = (titanic.age < 10) & (titanic.sex == 'female')
titanic.loc[Filter_2,:].head()

     survived  pclass     sex  age  ...  deck  embark_town  alive  alone
10          1       3  female  4.0  ...     G  Southampton    yes  False
24          0       3  female  8.0  ...   NaN  Southampton     no  False
43          1       2  female  3.0  ...   NaN    Cherbourg    yes  False
58          1       2  female  5.0  ...   NaN  Southampton    yes  False
119         0       3  female  2.0  ...   NaN  Southampton     no  False

[5 rows x 15 columns]

In [ ]:
Filter_3 = (titanic.age < 10) | (titanic.age >=60)
titanic.loc[Filter_3, ['age','sex','alone']].head()

     age     sex  alone
7    2.0    male  False
10   4.0  female  False
16   2.0    male  False
24   8.0  female  False
33  66.0    male   True

In [ ]:
titanic.loc[Filter_3, :].head()

    survived  pclass     sex   age  ...  deck  embark_town  alive  alone
7          0       3    male   2.0  ...   NaN  Southampton     no  False
10         1       3  female   4.0  ...     G  Southampton    yes  False
16         0       3    male   2.0  ...   NaN   Queenstown     no  False
24         0       3  female   8.0  ...   NaN  Southampton     no  False
33         0       2    male  66.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [ ]:
Filter_isin = titanic['sibsp'].isin([3,4,5])
titanic[Filter_isin].head(5)

    survived  pclass     sex   age  ...  deck  embark_town  alive  alone
7          0       3    male   2.0  ...   NaN  Southampton     no  False
16         0       3    male   2.0  ...   NaN   Queenstown     no  False
24         0       3  female   8.0  ...   NaN  Southampton     no  False
27         0       1    male  19.0  ...     C  Southampton     no  False
50         0       3    male   7.0  ...   NaN  Southampton     no  False

[5 rows x 15 columns]

In [ ]:
import pandas as pd
DF1 = pd.DataFrame({'HP':['hp0','hp1','hp2','hp3'],
                    'IBM':['ibm0','ibm1','ibm2','ibm3'],
                    'DELL':['dell0','dell1','dell2','dell3']},
                   index = [0,1,2,3])

DF1

    HP   IBM   DELL
0  hp0  ibm0  dell0
1  hp1  ibm1  dell1
2  hp2  ibm2  dell2
3  hp3  ibm3  dell3

In [ ]:
DF2 = pd.DataFrame({'HP':['hp2','hp3','hp4','hp5'],
                    'IBM':['ibm2','ibm3','ibm4','ibm5'],
                    'DELL':['dell2','dell3','dell4','dell5'],
                    'ASUS':['asus2','asus3','asus4','asus5']},
                   index=[2,3,4,5])
DF2

    HP   IBM   DELL   ASUS
2  hp2  ibm2  dell2  asus2
3  hp3  ibm3  dell3  asus3
4  hp4  ibm4  dell4  asus4
5  hp5  ibm5  dell5  asus5

In [ ]:
pd.concat([DF1, DF2], axis=0)

    HP   IBM   DELL   ASUS
0  hp0  ibm0  dell0    NaN
1  hp1  ibm1  dell1    NaN
2  hp2  ibm2  dell2    NaN
3  hp3  ibm3  dell3    NaN
2  hp2  ibm2  dell2  asus2
3  hp3  ibm3  dell3  asus3
4  hp4  ibm4  dell4  asus4
5  hp5  ibm5  dell5  asus5

In [ ]:
# 기존에 있던 index는 무시하고 새로 생성
pd.concat([DF1, DF2], axis=0, ignore_index=True)

    HP   IBM   DELL   ASUS
0  hp0  ibm0  dell0    NaN
1  hp1  ibm1  dell1    NaN
2  hp2  ibm2  dell2    NaN
3  hp3  ibm3  dell3    NaN
4  hp2  ibm2  dell2  asus2
5  hp3  ibm3  dell3  asus3
6  hp4  ibm4  dell4  asus4
7  hp5  ibm5  dell5  asus5

In [ ]:
pd.concat([DF1,DF2], axis=1, join='inner')

    HP   IBM   DELL   HP   IBM   DELL   ASUS
2  hp2  ibm2  dell2  hp2  ibm2  dell2  asus2
3  hp3  ibm3  dell3  hp3  ibm3  dell3  asus3

In [ ]:
pd.concat([DF1,DF2], axis=1, join='outer')

    HP   IBM   DELL   HP   IBM   DELL   ASUS
0  hp0  ibm0  dell0  NaN   NaN    NaN    NaN
1  hp1  ibm1  dell1  NaN   NaN    NaN    NaN
2  hp2  ibm2  dell2  hp2  ibm2  dell2  asus2
3  hp3  ibm3  dell3  hp3  ibm3  dell3  asus3
4  NaN   NaN    NaN  hp4  ibm4  dell4  asus4
5  NaN   NaN    NaN  hp5  ibm5  dell5  asus5

In [ ]:
pd.merge(DF1, DF2)

    HP   IBM   DELL   ASUS
0  hp2  ibm2  dell2  asus2
1  hp3  ibm3  dell3  asus3

In [ ]:
pd.merge(DF1,DF2, how='outer')

    HP   IBM   DELL   ASUS
0  hp0  ibm0  dell0    NaN
1  hp1  ibm1  dell1    NaN
2  hp2  ibm2  dell2  asus2
3  hp3  ibm3  dell3  asus3
4  hp4  ibm4  dell4  asus4
5  hp5  ibm5  dell5  asus5

In [ ]:
pd.merge(DF1, DF2, how='left')

    HP   IBM   DELL   ASUS
0  hp0  ibm0  dell0    NaN
1  hp1  ibm1  dell1    NaN
2  hp2  ibm2  dell2  asus2
3  hp3  ibm3  dell3  asus3

In [ ]:
pd.merge(DF1, DF2, how='right')

    HP   IBM   DELL   ASUS
0  hp2  ibm2  dell2  asus2
1  hp3  ibm3  dell3  asus3
2  hp4  ibm4  dell4  asus4
3  hp5  ibm5  dell5  asus5

In [ ]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

DF = titanic.loc[:,['age','sex','class','fare','survived']]

DF.head()

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
1  38.0  female  First  71.2833         1
2  26.0  female  Third   7.9250         1
3  35.0  female  First  53.1000         1
4  35.0    male  Third   8.0500         0

In [ ]:
grouped = DF.groupby(['class'])

grouped

In [ ]:
for key in ['First','Second','Third']:
  print(grouped.get_group(key).head(3))
  print('\n')

    age     sex  class     fare  survived
1  38.0  female  First  71.2833         1
3  35.0  female  First  53.1000         1
6  54.0    male  First  51.8625         0


     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
17   NaN    male  Second  13.0000         1


    age     sex  class   fare  survived
0  22.0    male  Third  7.250         0
2  26.0  female  Third  7.925         1
4  35.0    male  Third  8.050         0

In [ ]:
grouped.mean()

              age       fare  survived
class
First   38.233441  84.154687  0.629630
Second  29.877630  20.662183  0.472826
Third   25.140620  13.675550  0.242363

In [ ]:
grouped.get_group('Third').head(3)

    age     sex  class   fare  survived
0  22.0    male  Third  7.250         0
2  26.0  female  Third  7.925         1
4  35.0    male  Third  8.050         0

In [ ]:
grouped_TWO = DF.groupby(['class','sex'])
grouped_TWO

In [ ]:
for key, group in grouped_TWO:
  print('*key : ', key)
  print('*number :', len(group))
  print(group.head(3))
  print('평균 나이 : ', group.age.mean())
  print('\n')

*key :  ('First', 'female')
*number : 94
     age     sex  class     fare  survived
1   38.0  female  First  71.2833         1
3   35.0  female  First  53.1000         1
11  58.0  female  First  26.5500         1
평균 나이 :  34.61176470588235


*key :  ('First', 'male')
*number : 122
     age   sex  class      fare  survived
6   54.0  male  First   51.8625         0
23  28.0  male  First   35.5000         1
27  19.0  male  First  263.0000         0
평균 나이 :  41.28138613861386


*key :  ('Second', 'female')
*number : 76
     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
41  27.0  female  Second  21.0000         0
평균 나이 :  28.722972972972972


*key :  ('Second', 'male')
*number : 108
     age   sex   class  fare  survived
17   NaN  male  Second  13.0         1
20  35.0  male  Second  26.0         0
21  34.0  male  Second  13.0         1
평균 나이 :  30.74070707070707


*key :  ('Third', 'female')
*number : 144
     age     sex  class     fare  survived
2   26.0  female  Third   7.9250         1
8   27.0  female  Third  11.1333         1
10   4.0  female  Third  16.7000         1
평균 나이 :  21.75


*key :  ('Third', 'male')
*number : 347
    age   sex  class    fare  survived
0  22.0  male  Third  7.2500         0
4  35.0  male  Third  8.0500         0
5   NaN  male  Third  8.4583         0
평균 나이 :  26.507588932806325

In [ ]:
grouped_TWO.get_group(('First','female')).head(3)

     age     sex  class     fare  survived
1   38.0  female  First  71.2833         1
3   35.0  female  First  53.1000         1
11  58.0  female  First  26.5500         1

In [ ]:
grouped.agg(['mean','std'])

              age                  fare             survived
             mean        std       mean        std      mean       std
class
First   38.233441  14.802856  84.154687  78.380373  0.629630  0.484026
Second  29.877630  14.001077  20.662183  13.417399  0.472826  0.500623
Third   25.140620  12.495398  13.675550  11.778142  0.242363  0.428949

In [ ]:
grouped_TWO.agg(['mean','std'])

                     age                   fare             survived
                    mean        std        mean        std      mean       std
class  sex
First  female  34.611765  13.612052  106.125798  74.259988  0.968085  0.176716
       male    41.281386  15.139570   67.226127  77.548021  0.368852  0.484484
Second female  28.722973  12.872702   21.970121  10.891796  0.921053  0.271448
       male    30.740707  14.793894   19.741782  14.922235  0.157407  0.365882
Third  female  21.750000  12.729964   16.118810  11.690314  0.500000  0.501745
       male    26.507589  12.159514   12.661633  11.681696  0.135447  0.342694

In [ ]:
grouped.fare.agg(['min','max'])

        min       max
class
First   0.0  512.3292
Second  0.0   73.5000
Third   0.0   69.5500

In [ ]:
grouped.agg({'fare':['min','max'],'age':['mean','std']})

       fare                  age
        min       max       mean        std
class
First   0.0  512.3292  38.233441  14.802856
Second  0.0   73.5000  29.877630  14.001077
Third   0.0   69.5500  25.140620  12.495398

In [ ]:
DF.head(3)

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
1  38.0  female  First  71.2833         1
2  26.0  female  Third   7.9250         1

In [ ]:
def z_score(x):
  return (x-x.mean())/x.std()

In [ ]:
# grouped된 age가 x 변수가 되는
DF['z_score']=grouped.age.transform(z_score)

In [ ]:
DF.head()

    age     sex  class     fare  survived   z_score
0  22.0    male  Third   7.2500         0 -0.251342
1  38.0  female  First  71.2833         1 -0.015770
2  26.0  female  Third   7.9250         1  0.068776
3  35.0  female  First  53.1000         1 -0.218434
4  35.0    male  Third   8.0500         0  0.789041

In [ ]:
DF['z_score']=DF.fare.transform(z_score)
DF.head()

    age     sex  class     fare  survived   z_score
0  22.0    male  Third   7.2500         0 -0.502163
1  38.0  female  First  71.2833         1  0.786404
2  26.0  female  Third   7.9250         1 -0.488580
3  35.0  female  First  53.1000         1  0.420494
4  35.0    male  Third   8.0500         0 -0.486064

In [ ]:
grouped.filter(lambda x: len(x) >= 200).head(10)

     age     sex  class     fare  survived   z_score
0   22.0    male  Third   7.2500         0 -0.502163
1   38.0  female  First  71.2833         1  0.786404
2   26.0  female  Third   7.9250         1 -0.488580
3   35.0  female  First  53.1000         1  0.420494
4   35.0    male  Third   8.0500         0 -0.486064
5    NaN    male  Third   8.4583         0 -0.477848
6   54.0    male  First  51.8625         0  0.395591
7    2.0    male  Third  21.0750         0 -0.223957
8   27.0  female  Third  11.1333         1 -0.424018
10   4.0  female  Third  16.7000         1 -0.311997

In [ ]:
grouped.apply(len)

class
First     216
Second    184
Third     491
dtype: int64

In [ ]:
grouped.apply(len)

class
First     216
Second    184
Third     491
dtype: int64

In [ ]:
grouped.age.mean()

class
First     38.233441
Second    29.877630
Third     25.140620
Name: age, dtype: float64

In [ ]:
grouped.filter(lambda x: x.age.mean() < 30).tail(10)

      age     sex   class     fare  survived   z_score
878   NaN    male   Third   7.8958         0 -0.489167
880  25.0  female  Second  26.0000         1 -0.124850
881  33.0    male   Third   7.8958         0 -0.489167
882  22.0  female   Third  10.5167         0 -0.436426
883  28.0    male  Second  10.5000         0 -0.436762
884  25.0    male   Third   7.0500         0 -0.506188
885  39.0  female   Third  29.1250         0 -0.061964
886  27.0    male  Second  13.0000         0 -0.386454
888   NaN  female   Third  23.4500         0 -0.176164
890  32.0    male   Third   7.7500         0 -0.492101

In [ ]:
grouped.apply(lambda x: x.describe())

                     age        fare    survived     z_score
class
First  count  186.000000  216.000000  216.000000  216.000000
       mean    38.233441   84.154687    0.629630    1.045420
       std     14.802856   78.380373    0.484026    1.577278
       min      0.920000    0.000000    0.000000   -0.648058
       25%     27.000000   30.923950    0.000000   -0.025763
       50%     37.000000   60.287500    1.000000    0.565131
       75%     49.000000   93.500000    1.000000    1.233479
       max     80.000000  512.329200    1.000000    9.661740
Second count  173.000000  184.000000  184.000000  184.000000
       mean    29.877630   20.662183    0.472826   -0.232265
       std     14.001077   13.417399    0.500623    0.270003
       min      0.670000    0.000000    0.000000   -0.648058
       25%     23.000000   13.000000    0.000000   -0.386454
       50%     29.000000   14.250000    0.000000   -0.361299
       75%     36.000000   26.000000    1.000000   -0.124850
       max     70.000000   73.500000    1.000000    0.831011
Third  count  355.000000  491.000000  491.000000  491.000000
       mean    25.140620   13.675550    0.242363   -0.372859
       std     12.495398   11.778142    0.428949    0.237016
       min      0.420000    0.000000    0.000000   -0.648058
       25%     18.000000    7.750000    0.000000   -0.492101
       50%     24.000000    8.050000    0.000000   -0.486064
       75%     32.000000   15.500000    0.000000   -0.336145
       max     74.000000   69.550000    1.000000    0.751524

In [ ]:
grouped_MI = DF.groupby(['class','sex'])

In [ ]:
grouped_MI.mean()

                     age        fare  survived   z_score
class  sex
First  female  34.611765  106.125798  0.968085  1.487553
       male    41.281386   67.226127  0.368852  0.704760
Second female  28.722973   21.970121  0.921053 -0.205944
       male    30.740707   19.741782  0.157407 -0.250786
Third  female  21.750000   16.118810  0.500000 -0.323693
       male    26.507589   12.661633  0.135447 -0.393263

In [ ]:
grouped_MI.mean().xs('First',level='class')

              age        fare  survived   z_score
sex
female  34.611765  106.125798  0.968085  1.487553
male    41.281386   67.226127  0.368852  0.704760

In [ ]:
grouped_MI.mean().xs('female', level = 'sex')

              age        fare  survived   z_score
class
First   34.611765  106.125798  0.968085  1.487553
Second  28.722973   21.970121  0.921053 -0.205944
Third   21.750000   16.118810  0.500000 -0.323693

In [ ]:
grouped_MI.mean().xs(['First','male'], level=['class','sex'])

                  age       fare  survived  z_score
class sex
First male  41.281386  67.226127  0.368852  0.70476

In [ ]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

DF = titanic.loc[:,['age','sex','class','fare','survived']]
DF.head(3)

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
1  38.0  female  First  71.2833         1
2  26.0  female  Third   7.9250         1

In [ ]:
DF_1 = pd.pivot_table(DF,
                      index = 'class',
                      columns = 'sex',
                      values = 'age',
                      aggfunc='mean')
DF_1

sex        female       male
class
First   34.611765  41.281386
Second  28.722973  30.740707
Third   21.750000  26.507589

In [ ]:
DF_2 = pd.pivot_table(DF,
                      index = 'class',
                      columns = 'sex',
                      values = 'survived',
                      aggfunc=['mean','sum'])
DF_2

            mean              sum
sex       female      male female male
class
First   0.968085  0.368852     91   45
Second  0.921053  0.157407     70   17
Third   0.500000  0.135447     72   47

In [ ]:
DF_3 = pd.pivot_table(DF, 
                      index=['class','sex'],
                       columns = ['survived'],
                      values = ['age','fare'],
                       aggfunc=['mean','max'])
DF_3

                    mean                         ...   max
                     age                   fare  ...   age    fare
survived               0          1           0  ...     1       0         1
class  sex                                       ...
First  female  25.666667  34.939024  110.604167  ...  63.0  151.55  512.3292
       male    44.581967  36.248000   62.894910  ...  80.0  263.00  512.3292
Second female  36.000000  28.080882   18.250000  ...  55.0   26.00   65.0000
       male    33.369048  16.022000   19.488965  ...  62.0   73.50   39.0000
Third  female  23.818182  19.329787   19.773093  ...  63.0   69.55   31.3875
       male    27.255814  22.274211   12.204469  ...  45.0   69.55   56.4958

[6 rows x 8 columns]

In [ ]:
DF_3.index

MultiIndex([( 'First', 'female'),
            ( 'First',   'male'),
            ('Second', 'female'),
            ('Second',   'male'),
            ( 'Third', 'female'),
            ( 'Third',   'male')],
           names=['class', 'sex'])

In [ ]:
DF_3.columns

MultiIndex([('mean',  'age', 0),
            ('mean',  'age', 1),
            ('mean', 'fare', 0),
            ('mean', 'fare', 1),
            ( 'max',  'age', 0),
            ( 'max',  'age', 1),
            ( 'max', 'fare', 0),
            ( 'max', 'fare', 1)],
           names=[None, None, 'survived'])

In [ ]:
DF_3.xs('First', axis=0)

               mean                         ...   max
                age                   fare  ...   age    fare
survived          0          1           0  ...     1       0         1
sex                                         ...
female    25.666667  34.939024  110.604167  ...  63.0  151.55  512.3292
male      44.581967  36.248000   62.894910  ...  80.0  263.00  512.3292

[2 rows x 8 columns]

In [ ]:
DF_3.xs(('First','female'), axis = 0)

            survived
mean  age   0            25.666667
            1            34.939024
      fare  0           110.604167
            1           105.978159
max   age   0            50.000000
            1            63.000000
      fare  0           151.550000
            1           512.329200
Name: (First, female), dtype: float64

In [ ]:
DF_3.xs(('First','female'),  axis = 0)

            survived
mean  age   0            25.666667
            1            34.939024
      fare  0           110.604167
            1           105.978159
max   age   0            50.000000
            1            63.000000
      fare  0           151.550000
            1           512.329200
Name: (First, female), dtype: float64

In [ ]:
DF_3.xs(('First','female'), level=['class','sex'], axis=0)

                   mean                         ...   max
                    age                   fare  ...   age    fare
survived              0          1           0  ...     1       0         1
class sex                                       ...
First female  25.666667  34.939024  110.604167  ...  63.0  151.55  512.3292

[1 rows x 8 columns]

In [ ]:
DF_3.xs('male', level='sex', axis=0)

               mean                        ...   max
                age                  fare  ...   age    fare
survived          0          1          0  ...     1       0         1
class                                      ...
First     44.581967  36.248000  62.894910  ...  80.0  263.00  512.3292
Second    33.369048  16.022000  19.488965  ...  62.0   73.50   39.0000
Third     27.255814  22.274211  12.204469  ...  45.0   69.55   56.4958

[3 rows x 8 columns]

In [ ]:
DF_3.xs(('First','male'), level=['class','sex'], axis=0)

                 mean                               max
                  age              fare             age         fare
survived            0       1         0         1     0     1      0         1
class sex
First male  44.581967  36.248  62.89491  74.63732  71.0  80.0  263.0  512.3292

In [ ]:
DF_3.xs('mean', axis=1)

                     age                   fare
survived               0          1           0           1
class  sex
First  female  25.666667  34.939024  110.604167  105.978159
       male    44.581967  36.248000   62.894910   74.637320
Second female  36.000000  28.080882   18.250000   22.288989
       male    33.369048  16.022000   19.488965   21.095100
Third  female  23.818182  19.329787   19.773093   12.464526
       male    27.255814  22.274211   12.204469   15.579696

In [ ]:
DF_3.xs(('mean','fare'), axis=1)

survived                0           1
class  sex
First  female  110.604167  105.978159
       male     62.894910   74.637320
Second female   18.250000   22.288989
       male     19.488965   21.095100
Third  female   19.773093   12.464526
       male     12.204469   15.579696

In [ ]:
DF_3

                    mean                         ...   max
                     age                   fare  ...   age    fare
survived               0          1           0  ...     1       0         1
class  sex                                       ...
First  female  25.666667  34.939024  110.604167  ...  63.0  151.55  512.3292
       male    44.581967  36.248000   62.894910  ...  80.0  263.00  512.3292
Second female  36.000000  28.080882   18.250000  ...  55.0   26.00   65.0000
       male    33.369048  16.022000   19.488965  ...  62.0   73.50   39.0000
Third  female  23.818182  19.329787   19.773093  ...  63.0   69.55   31.3875
       male    27.255814  22.274211   12.204469  ...  45.0   69.55   56.4958

[6 rows x 8 columns]

In [ ]:
 # level=[0,1,'survived'] 같은 뜻.. level = 열x, 행 인덱스
 # level=0 (상위 레벨),  level = 1 (하위 레벨)
 # index가 여러층(level)을 갖는다


DF_3.xs(('max','age',0), level=[0,1,2], axis=1)

                max
                age
survived          0
class  sex
First  female  50.0
       male    71.0
Second female  57.0
       male    70.0
Third  female  48.0
       male    74.0

In [ ]:
DF_3.xs(1, level='survived', axis=1)

                    mean               max
                     age        fare   age      fare
class  sex
First  female  34.939024  105.978159  63.0  512.3292
       male    36.248000   74.637320  80.0  512.3292
Second female  28.080882   22.288989  55.0   65.0000
       male    16.022000   21.095100  62.0   39.0000
Third  female  19.329787   12.464526  63.0   31.3875
       male    22.274211   15.579696  45.0   56.4958

In [ ]:
DF_3

                    mean                         ...   max
                     age                   fare  ...   age    fare
survived               0          1           0  ...     1       0         1
class  sex                                       ...
First  female  25.666667  34.939024  110.604167  ...  63.0  151.55  512.3292
       male    44.581967  36.248000   62.894910  ...  80.0  263.00  512.3292
Second female  36.000000  28.080882   18.250000  ...  55.0   26.00   65.0000
       male    33.369048  16.022000   19.488965  ...  62.0   73.50   39.0000
Third  female  23.818182  19.329787   19.773093  ...  63.0   69.55   31.3875
       male    27.255814  22.274211   12.204469  ...  45.0   69.55   56.4958

[6 rows x 8 columns]